Tekla Open API Reference for Tekla Structures 2025
Plugin.SetAttribute Method (String, Double)
 Sets the specified attribute of the plug-in to the given value. NOTE! Only works on already inserted plug-ins.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void SetAttribute(
	string FieldName,
	double fieldValue
)
Public Sub SetAttribute (
	FieldName As String,
	fieldValue As Double
)
Parameters
FieldName
Type: System.String
The name of the attribute to set.
fieldValue
Type: System.Double
The value for the attribute.
Exceptions
Exception | Condition
CannotSetAttributeForPluginException |  Thrown when setting the attribute to the plug-in failed for an unknown reason (might indicate an invalid plug-in name).
CannotSetAttributeForPluginDueToIncorrectTypeException |  Thrown when setting a value with an invalid type for the specified field.
CannotSetAttributeForPluginDueToInexistantFieldException |  Thrown when setting the value of an inexistent field.
See Also
Reference
Plugin Class
SetAttribute Overload
Tekla.Structures.Drawing Namespace